; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-5-15)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room3)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room4)
(at ball2 room2)
(at ball3 room4)
(at ball4 room1)
(at ball5 room1)
(at ball6 room2)
(at ball7 room4)
(at ball8 room1)
(at ball9 room4)
(at ball10 room3)
(at ball11 room4)
(at ball12 room2)
(at ball13 room5)
(at ball14 room2)
(at ball15 room3)
)
(:goal
(and
(at ball1 room4)
(at ball2 room3)
(at ball3 room3)
(at ball4 room2)
(at ball5 room5)
(at ball6 room4)
(at ball7 room2)
(at ball8 room1)
(at ball9 room2)
(at ball10 room3)
(at ball11 room5)
(at ball12 room5)
(at ball13 room1)
(at ball14 room4)
(at ball15 room1)
)
)
)

; plan
1. (pick robot1 ball5 room1 rgripper1)
   deleted: (at ball5 room1) (free robot1 rgripper1)
   added: (carry robot1 ball5 rgripper1)
   goals met: 3 of 15
2. (pick robot2 ball15 room3 lgripper2)
   deleted: (at ball15 room3) (free robot2 lgripper2)
   added: (carry robot2 ball15 lgripper2)
   goals met: 3 of 15
3. (pick robot1 ball4 room1 lgripper1)
   deleted: (at ball4 room1) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 3 of 15
4. (move robot1 room1 room2)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room2)
   goals met: 3 of 15
5. (drop robot1 ball4 room2 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room2) (free robot1 lgripper1)
   goals met: 4 of 15
6. (pick robot1 ball6 room2 lgripper1)
   deleted: (at ball6 room2) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 4 of 15
7. (move robot1 room2 room5)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room5)
   goals met: 4 of 15
8. (drop robot1 ball5 room5 rgripper1)
   deleted: (carry robot1 ball5 rgripper1)
   added: (at ball5 room5) (free robot1 rgripper1)
   goals met: 5 of 15
9. (pick robot1 ball13 room5 rgripper1)
   deleted: (at ball13 room5) (free robot1 rgripper1)
   added: (carry robot1 ball13 rgripper1)
   goals met: 5 of 15
10. (move robot2 room3 room4)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room4)
   goals met: 5 of 15
11. (pick robot2 ball9 room4 rgripper2)
   deleted: (at ball9 room4) (free robot2 rgripper2)
   added: (carry robot2 ball9 rgripper2)
   goals met: 5 of 15
12. (move robot2 room4 room1)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room1)
   goals met: 5 of 15
13. (drop robot2 ball15 room1 lgripper2)
   deleted: (carry robot2 ball15 lgripper2)
   added: (at ball15 room1) (free robot2 lgripper2)
   goals met: 6 of 15
14. (move robot2 room1 room3)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room3)
   goals met: 6 of 15
15. (move robot2 room3 room2)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room2)
   goals met: 6 of 15
16. (drop robot2 ball9 room2 rgripper2)
   deleted: (carry robot2 ball9 rgripper2)
   added: (at ball9 room2) (free robot2 rgripper2)
   goals met: 7 of 15
17. (pick robot2 ball12 room2 lgripper2)
   deleted: (at ball12 room2) (free robot2 lgripper2)
   added: (carry robot2 ball12 lgripper2)
   goals met: 7 of 15
18. (pick robot2 ball14 room2 rgripper2)
   deleted: (at ball14 room2) (free robot2 rgripper2)
   added: (carry robot2 ball14 rgripper2)
   goals met: 7 of 15
19. (move robot2 room2 room4)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room4)
   goals met: 7 of 15
20. (drop robot2 ball14 room4 rgripper2)
   deleted: (carry robot2 ball14 rgripper2)
   added: (at ball14 room4) (free robot2 rgripper2)
   goals met: 8 of 15
21. (move robot1 room5 room4)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room4)
   goals met: 8 of 15
22. (pick robot2 ball11 room4 rgripper2)
   deleted: (at ball11 room4) (free robot2 rgripper2)
   added: (carry robot2 ball11 rgripper2)
   goals met: 8 of 15
23. (drop robot1 ball6 room4 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room4) (free robot1 lgripper1)
   goals met: 9 of 15
24. (move robot2 room4 room5)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room5)
   goals met: 9 of 15
25. (drop robot2 ball12 room5 lgripper2)
   deleted: (carry robot2 ball12 lgripper2)
   added: (at ball12 room5) (free robot2 lgripper2)
   goals met: 10 of 15
26. (drop robot2 ball11 room5 rgripper2)
   deleted: (carry robot2 ball11 rgripper2)
   added: (at ball11 room5) (free robot2 rgripper2)
   goals met: 11 of 15
27. (pick robot1 ball3 room4 lgripper1)
   deleted: (at ball3 room4) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 11 of 15
28. (move robot2 room5 room2)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room2)
   goals met: 11 of 15
29. (pick robot2 ball2 room2 lgripper2)
   deleted: (at ball2 room2) (free robot2 lgripper2)
   added: (carry robot2 ball2 lgripper2)
   goals met: 11 of 15
30. (move robot1 room4 room3)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room3)
   goals met: 11 of 15
31. (drop robot1 ball3 room3 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room3) (free robot1 lgripper1)
   goals met: 12 of 15
32. (move robot1 room3 room1)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room1)
   goals met: 12 of 15
33. (drop robot1 ball13 room1 rgripper1)
   deleted: (carry robot1 ball13 rgripper1)
   added: (at ball13 room1) (free robot1 rgripper1)
   goals met: 13 of 15
34. (move robot2 room2 room4)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room4)
   goals met: 13 of 15
35. (pick robot2 ball7 room4 rgripper2)
   deleted: (at ball7 room4) (free robot2 rgripper2)
   added: (carry robot2 ball7 rgripper2)
   goals met: 13 of 15
36. (move robot2 room4 room3)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room3)
   goals met: 13 of 15
37. (drop robot2 ball2 room3 lgripper2)
   deleted: (carry robot2 ball2 lgripper2)
   added: (at ball2 room3) (free robot2 lgripper2)
   goals met: 14 of 15
38. (move robot2 room3 room2)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room2)
   goals met: 14 of 15
39. (drop robot2 ball7 room2 rgripper2)
   deleted: (carry robot2 ball7 rgripper2)
   added: (at ball7 room2) (free robot2 rgripper2)
   goals met: 15 of 15
